{
  "section_title": "My Projects",
  "description": "Personal projects I've been building throughout my learning journey.",
  "projects": {
    "project1": {
      "title": "My Portfolio",
      "shortDescription": "Portfolio created to showcase my skills and projects I have developed.",
      "longDescription": "This portfolio was built to highlight my technical expertise and the projects I have worked on throughout my development journey. Developed with React and bundled using Vite, it leverages TailwindCSS for styling, Shadcn for reusable and high-performance components, i18next for multilingual support, and Framer Motion for dynamic animations and transitions."
    },
    "barbershop": {
      "title": "Barbershop Aparatus - FSW",
      "shortDescription": "Barbershop webapp with booking, authentication, and routing, built using Next.js, Tailwind, Shadcn/UI, Zod, PostgreSQL, and Prisma.",
      "longDescription": "A complete barbershop web application developed during Fullstack Week, featuring appointment scheduling, authentication, and dynamic routing. Built with Next.js for high performance, styled using Tailwind CSS, and enhanced with Shadcn/UI components for a modern and accessible interface. Data validation is handled by Zod, ensuring security and reliability. On the backend, it uses PostgreSQL integrated with Prisma ORM, providing efficient and type-safe queries. This project showcases best practices and modern technologies to deliver a scalable and seamless user experience."
    },
    "hora-mundi": {
      "title": "Hora Mundi",
      "shortDescription": "Simple website built with JavaScript, HTML, and CSS, showing the current time worldwide using UTC logic. Includes Day.js for date handling and Micromodal for modals.",
      "longDescription": "Simple website built with JavaScript, HTML, and pure CSS to display the current time around the world using UTC logic. Utilizes Day.js for date handling and Micromodal for accessible modals. A minimal and responsive project focused on functionality and accuracy."
    }
  },
  "filter": {
    "search": {
      "placeholder": "Type something...",
      "notFound": "Sorry, i couldn't find what you're looking for"
    },
    "category": {
      "placeholder": "Select a technology...",
      "searchText": "Type something...",
      "notFound": "I didn't find anything.."
    }
  }
}
