{
  "section_title": "My Projects",
  "description": "Personal projects I've been building throughout my learning journey.",
  "projects": {
    "project1": {
      "title": "My Portfolio",
      "shortDescription": "Portfolio created to showcase my skills and projects I have developed.",
      "longDescription": "This portfolio was built to highlight my technical expertise and the projects I have worked on throughout my development journey. Developed with React and bundled using Vite, it leverages TailwindCSS for styling, Shadcn for reusable and high-performance components, i18next for multilingual support, and Framer Motion for dynamic animations and transitions."
    },
    "barbershop": {
      "title": "Barbershop Aparatus - FSW",
      "shortDescription": "Barbershop webapp with booking, authentication, and routing, built using Next.js, Tailwind, Shadcn/UI, Zod, PostgreSQL, and Prisma.",
      "longDescription": "A complete barbershop web application developed during Fullstack Week, featuring appointment scheduling, authentication, and dynamic routing. Built with Next.js for high performance, styled using Tailwind CSS, and enhanced with Shadcn/UI components for a modern and accessible interface. Data validation is handled by Zod, ensuring security and reliability. On the backend, it uses PostgreSQL integrated with Prisma ORM, providing efficient and type-safe queries. This project showcases best practices and modern technologies to deliver a scalable and seamless user experience."
    },
    "entre-trilhas": {
      "title": "Entre Trilhas",
      "shortDescription": "Project developed as a creative and strategic design exercise.",
      "longDescription": "Entre Trilhas is a fictional project developed as a creative and strategic design exercise. The main objective was to explore concepts of visual identity, user experience, and interface design. The project includes the creation of a logo, color palette, typography, and layouts for different platforms, aiming to provide a cohesive and engaging experience for users interested in trails and outdoor adventures."
    },
    "super-milk": {
      "title": "Super Milk",
      "shortDescription": "Design idea for an artisanal ice cream shop.",
      "longDescription": "Super Milk is a fictional project developed as a visual identity and digital experience study for an artisanal ice cream shop located in a tourist area. The project was born with the intention of translating, through design, the joy, lightness, and artisanal character of the brand."
    },
    "visivel": {
      "title": "Visível",
      "shortDescription": "Portfolio of photography focused on originality.",
      "longDescription": "The purpose of the project was to create a platform that would not compete with the images, but rather act as an extension of the photographic gaze. The interface was designed to be contained, silent, and human, allowing the rhythm of the photographs to guide the user's experience."
    }
  },
  "filter": {
    "search": {
      "placeholder": "Type something...",
      "notFound": "Sorry, i couldn't find what you're looking for"
    },
    "category": {
      "placeholder": "Select a technology...",
      "searchText": "Type something...",
      "notFound": "I didn't find anything.."
    }
  }
}
