{
  "section_title": "Meus Projetos",
  "description": "Projetos pessoais que tenho construído durante minha jornada de aprendizado.",
  "projects": {
    "project1": {
      "title": "Meu Portfolio",
      "shortDescription": "Portfólio criado para destacar minhas habilidades e projetos desenvolvidos.",
      "longDescription": "Este portfólio foi desenvolvido para apresentar minhas competências técnicas e os trabalhos realizados ao longo da minha jornada como desenvolvedor. Construído com React e empacotado com Vite, utiliza TailwindCSS para estilização, Shadcn para componentes reutilizáveis e de alta performance, i18next para suporte multilíngue e Framer Motion para animações e transições dinâmicas."
    },
    "barbershop": {
      "title": "Barbershop Aparatus - FSW",
      "shortDescription": "Webapp para barbearia com agendamento, autenticação e roteamento, feito com Next.js, Tailwind, Shadcn/UI, Zod, PostgreSQL e Prisma.",
      "longDescription": "Aplicação web para barbearias desenvolvida durante a Fullstack Week, com recursos de agendamento, autenticação e roteamento dinâmico. Construída em Next.js para alta performance, estilizada com Tailwind CSS e componentes Shadcn/UI para uma interface moderna. A validação é feita com Zod, garantindo segurança nos dados. No backend, utiliza PostgreSQL integrado via Prisma ORM, oferecendo consultas eficientes e tipadas. Um projeto que combina boas práticas e tecnologias atuais para criar uma experiência completa e escalável."
    },
    "hora-mundi": {
      "title": "Hora Mundi",
      "shortDescription": "Website simples feito com JavaScript, HTML e CSS, que mostra o horário atual ao redor do mundo usando lógica baseada em UTC. Utiliza Day.js para manipulação de datas e Micromodal para modais.",
      "longDescription": "Website simples desenvolvido com JavaScript, HTML e CSS puro, que exibe o horário atual em diferentes partes do mundo usando lógica baseada em UTC. Conta com Day.js para manipulação de datas e Micromodal para modais acessíveis. Um projeto minimalista e responsivo, focado em funcionalidade e precisão."
    }
  },
  "filter": {
    "search": {
      "placeholder": "Digite algo...",
      "notFound": "Me desculpe, não achei o que está procurando"
    },
    "category": {
      "placeholder": "Selecione uma tecnologia...",
      "searchText": "Digite alguma coisa...",
      "notFound": "Não encontrei nada.."
    }
  }
}
