{
  "section_title": "Meus Projetos",
  "description": "Projetos pessoais que tenho construído durante minha jornada de aprendizado.",
  "projects": {
    "project1": {
      "title": "Meu Portfolio",
      "shortDescription": "Portfólio criado para destacar minhas habilidades e projetos desenvolvidos.",
      "longDescription": "Este portfólio foi desenvolvido para apresentar minhas competências técnicas e os trabalhos realizados ao longo da minha jornada como desenvolvedor. Construído com React e empacotado com Vite, utiliza TailwindCSS para estilização, Shadcn para componentes reutilizáveis e de alta performance, i18next para suporte multilíngue e Framer Motion para animações e transições dinâmicas."
    },
    "barbershop": {
      "title": "Barbershop Aparatus - FSW",
      "shortDescription": "Webapp para barbearia com agendamento, autenticação e roteamento, feito com Next.js, Tailwind, Shadcn/UI, Zod, PostgreSQL e Prisma.",
      "longDescription": "Aplicação web para barbearias desenvolvida durante a Fullstack Week, com recursos de agendamento, autenticação e roteamento dinâmico. Construída em Next.js para alta performance, estilizada com Tailwind CSS e componentes Shadcn/UI para uma interface moderna. A validação é feita com Zod, garantindo segurança nos dados. No backend, utiliza PostgreSQL integrado via Prisma ORM, oferecendo consultas eficientes e tipadas. Um projeto que combina boas práticas e tecnologias atuais para criar uma experiência completa e escalável."
    },
    "entre-trilhas": {
      "title": "Entre Trilhas",
      "shortDescription": "Projeto desenvolvido como exercício criativo e estretégico de design.",
      "longDescription": "Entre Trilhas é um projeto fictício desenvolvido como um exercício criativo e estratégico de design. O objetivo principal foi explorar conceitos de identidade visual, experiência do usuário e design de interface. O projeto inclui a criação de um logotipo, paleta de cores, tipografia e layouts para diferentes plataformas, visando proporcionar uma experiência coesa e envolvente para os usuários interessados em trilhas e aventuras ao ar livre."
    },
    "super-milk": {
      "title": "Super Milk",
      "shortDescription": "Ideia de design para sorveteria artesanal.",
      "longDescription": "Super Milk é um projeto fictício desenvolvido como estudo de identidade visual e experiência digital para uma sorveteria artesanal localizada em um ponto turístico. O Projeto nasceu com a intenção de traduzir, através do design, a alegria a leveza e o caráter artesanal da marca."
    }
  },
  "filter": {
    "search": {
      "placeholder": "Digite algo...",
      "notFound": "Me desculpe, não achei o que está procurando"
    },
    "category": {
      "placeholder": "Selecione uma tecnologia...",
      "searchText": "Digite alguma coisa...",
      "notFound": "Não encontrei nada.."
    }
  }
}
